uhnp/src/InformationRegisters/СостоянияДокументовТрансляции/СостоянияДокументовТрансляции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияДокументовТрансляции</name>
  <resources>
    <name>ЕстьРасхождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИзмененыИсходныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИзмененШаблонКорректировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументТрансляции</name>
    <type>
      <types>DocumentRef.Трансляция</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ДокументыДляПовторнойТрансляции/ДокументыДляПовторнойТрансляции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыДляПовторнойТрансляции</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ШаблонТрансляции</name>
    <type>
      <types>CatalogRef.ШаблоныТрансляций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоответствиеСчетов</name>
    <type>
      <types>CatalogRef.СоответствияСчетовДляТрансляции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументТрансляции</name>
    <type>
      <types>DocumentRef.Трансляция</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИсходныйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ДокументыСводнойТрансляции/ДокументыСводнойТрансляции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыСводнойТрансляции</name>
  <resources>
    <name>ЕстьРасхождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИзмененыИсходныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИзмененШаблонКорректировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ШаблонТрансляции</name>
    <type>
      <types>CatalogRef.ШаблоныТрансляций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументТрансляции</name>
    <type>
      <types>DocumentRef.Трансляция</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СостоянияДокументовТрансляции/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
Процедура ЗаполнитьРегистрыСостоянияДокументов(Параметры=Неопределено) Экспорт
		
	НаборЗаписей=РегистрыСведений.ДокументыДляПовторнойТрансляции.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество()=0 Тогда
		
		Запрос=Новый Запрос; 
		Запрос.Текст="ВЫБРАТЬ
		|	СостоянияДокументовТрансляции.ДокументТрансляции.ШаблонКорректировки КАК ШаблонТрансляции,
		|	СостоянияДокументовТрансляции.ДокументТрансляции КАК ДокументТрансляции,
		|	СостоянияДокументовТрансляции.ДокументТрансляции.ИсходныйДокумент КАК ИсходныйДокумент,
		|	СостоянияДокументовТрансляции.ДокументТрансляции.Дата КАК ДатаДокумента,
		|	СостоянияДокументовТрансляции.ДокументТрансляции.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.СостоянияДокументовТрансляции КАК СостоянияДокументовТрансляции
		|ГДЕ
		|	НЕ СостоянияДокументовТрансляции.ДокументТрансляции.ИсходныйДокумент = НЕОПРЕДЕЛЕНО";
		
		НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());		
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;

	НаборЗаписей=РегистрыСведений.ДокументыСводнойТрансляции.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество()=0 Тогда
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	СостоянияДокументовТрансляции.ДокументТрансляции.ШаблонКорректировки КАК ШаблонТрансляции,
		|	СостоянияДокументовТрансляции.ДокументТрансляции.Организация КАК Организация,
		|	СостоянияДокументовТрансляции.ДокументТрансляции.ПериодОтчета КАК ПериодОтчета,
		|	СостоянияДокументовТрансляции.ДокументТрансляции КАК ДокументТрансляции,
		|	СостоянияДокументовТрансляции.ЕстьРасхождения КАК ЕстьРасхождения,
		|	СостоянияДокументовТрансляции.ИзмененыИсходныеДанные КАК ИзмененыИсходныеДанные,
		|	СостоянияДокументовТрансляции.ИзмененШаблонКорректировки КАК ИзмененШаблонКорректировки
		|ИЗ
		|	РегистрСведений.СостоянияДокументовТрансляции КАК СостоянияДокументовТрансляции
		|ГДЕ
		|	СостоянияДокументовТрансляции.ДокументТрансляции.ИсходныйДокумент = НЕОПРЕДЕЛЕНО";
		
		НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());		
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;		
		
КонецПроцедуры // ЗаполнитьРегистрыСостоянияДокументов() 

	
#КонецЕсли
